# Encoding Technique

- Ref:1032

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('supershop.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Data Exploration

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [4]:
df['Area'].value_counts()

Dhaka      17
Ctg        17
Rangpur    16
Name: Area, dtype: int64

## Null Handling

In [5]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

- A missing found at Transport, lets see

In [6]:
df.Transport         # missing at index 19

0     471784.10
1     443898.53
2     407934.54
3     383199.62
4     366168.42
5     362861.36
6     127716.82
7     323876.68
8     311613.29
9     304981.62
10    229160.95
11    249744.55
12    249839.44
13    252664.93
14    256512.92
15    261776.23
16    264346.06
17    282574.31
18    294919.57
19          NaN
20    298664.47
21    299737.29
22    303319.26
23    304768.73
24    140574.81
25    137962.62
26    134050.07
27    353183.81
28    118148.20
29    107138.38
30     91131.24
31     88218.23
32     46085.25
33    214634.81
34    210797.67
35    205517.64
36    201126.82
37    197029.42
38    185265.10
39    174999.30
40    172795.67
41    164470.71
42    148001.11
43     35534.17
44     28334.72
45      1903.93
46    297114.46
47         0.00
48         0.00
49     45173.06
Name: Transport, dtype: float64

In [7]:
df.Transport.mean()

215331.73244897963

In [8]:
# Required Copies
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()
df8 = df.copy()
df9 = df.copy()
df10 = df.copy()
df11 = df.copy()
df12 = df.copy()
df13 = df.copy()

#### Drop Vs Handling

- Drop : Drop removes entire row
- Replace: Missing handling is a good choice when there are few missing values e.g replacing by mean can be effecive
- Drop can  apply when there are higher missing values & data collection is close to impossible
- Before droping/ replace copy the dataset can be good practice

#### Drop Missing Values

In [9]:
df1.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [10]:
df_1 = df1.dropna()   # inside () press shift+tab for more details, axis = 0 means row to be deleted. axis= 1 column 
df_1.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

#### Verify Drop

In [11]:
df1.shape  # before drop

(50, 5)

In [12]:
df_1.shape # after drop  (1 row dropped)

(49, 5)

#### Dropping Parameters

- dropna(): shift+Tap >> see details
- default drop is 0 = row
- df2 = df.dropna(how='all')   >> Customization: all: when all null value for a entire row
- df2 = df.dropna(how='any')   >> its default, remove nall if any null found in a row

In [13]:
df2 = df2.dropna(how='all')  # null will not be removed, due to defining 'all' all = when all null value for a row
df2.shape                    # null will be drop if how='any', because in a row all not null. default 'any'

(50, 5)

In [14]:
df3.dropna(inplace=True)  # True = auto update need to store in var; False = need to update in a seperate var
df3.shape

(49, 5)

## Null Imputation

- Imputation is a technique used for replacing the missing data with some substitute value to retain most of the data/information of the dataset. These techniques are used because removing the data from the dataset every time is not feasible and can lead to a reduction in the size of the dataset to a large extend, which not only raises concerns for biasing the dataset but also leads to incorrect analysis.

In [15]:
# Replacing Missing Values by Mean:
df.Transport = df.Transport.fillna(df.Transport.mean())
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [16]:
df.shape

(50, 5)

In [17]:
df.Transport.mean()  # this will be visible in null postion, verify below

215331.73244897963

In [18]:
df                 # verify index 19, the null alread replaced by mean value

    Marketing Spend  Administration      Transport     Area     Profit
0         114523.61       136897.80  471784.100000    Dhaka  192261.83
1         162597.70       151377.59  443898.530000      Ctg  191792.06
2         153441.51       101145.55  407934.540000  Rangpur  191050.39
3         144372.41       118671.85  383199.620000    Dhaka  182901.99
4         142107.34        91391.77  366168.420000  Rangpur  166187.94
5         131876.90        99814.71  362861.360000    Dhaka  156991.12
6         134615.46       147198.87  127716.820000      Ctg  156122.51
7         130298.13       145530.06  323876.680000  Rangpur  155752.60
8         120542.52       148718.95  311613.290000    Dhaka  152211.77
9         123334.88       108679.17  304981.620000      Ctg  149759.96
10        101913.08       110594.11  229160.950000  Rangpur  146121.95
11        100671.96        91790.61  249744.550000      Ctg  144259.40
12         93863.75       127320.38  249839.440000  Rangpur  141585.52
13         91992.39       135495.07  252664.930000      Ctg  134307.35
14        119943.24       156547.42  256512.920000  Rangpur  132602.65
15        165349.20       122616.84  261776.230000    Dhaka  129917.04
16         78013.11       121597.55  264346.060000      Ctg  126992.93
17         94657.16       145077.58  282574.310000    Dhaka  125370.37
18         91749.16       114175.79  294919.570000  Rangpur  124266.90
19         86419.70       153514.11  215331.732449    Dhaka  122776.86
20         76253.86       113867.30  298664.470000      Ctg  118474.03
21         78389.47       153773.43  299737.290000    Dhaka  111313.02
22         73994.56       122782.75  303319.260000  Rangpur  110352.25
23         67532.53       105751.03  304768.730000  Rangpur  108733.99
24         77044.01        99281.34  140574.810000    Dhaka  108552.04
25         64664.71       139553.16  137962.620000      Ctg  107404.34
26         75328.87       144135.98  134050.070000  Rangpur  105733.54
27         72107.60       127864.55  353183.810000    Dhaka  105008.31
28         66051.52       182645.56  118148.200000  Rangpur  103282.38
29         65605.48       153032.06  107138.380000    Dhaka  101004.64
30         61994.48       115641.28   91131.240000  Rangpur   99937.59
31         61136.38       152701.92   88218.230000    Dhaka   97483.56
32         63408.86       129219.61   46085.250000      Ctg   97427.84
33         55493.95       103057.49  214634.810000  Rangpur   96778.92
34         46426.07       157693.92  210797.670000      Ctg   96712.80
35         46014.02        85047.44  205517.640000    Dhaka   96479.51
36         28663.76       127056.21  201126.820000  Rangpur   90708.19
37         44069.95        51283.14  197029.420000      Ctg   89949.14
38         20229.59        65947.93  185265.100000    Dhaka   81229.06
39         38558.51        82982.09  174999.300000      Ctg   81005.76
40         28754.33       118546.05  172795.670000      Ctg   78239.91
41         27892.92        84710.77  164470.710000  Rangpur   77798.83
42         23640.93        96189.63  148001.110000      Ctg   71498.49
43         15505.73       127382.30   35534.170000    Dhaka   69758.98
44         22177.74       154806.14   28334.720000      Ctg   65200.33
45          1000.23       124153.04    1903.930000    Dhaka   64926.08
46          1315.46       115816.21  297114.460000  Rangpur   49490.75
47             0.00       135426.92       0.000000      Ctg   42559.73
48           542.05        51743.15       0.000000    Dhaka   35673.41
49             0.00       116983.80   45173.060000      Ctg   14681.40

In [19]:
# Check Unique Value before Encoding
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

# Encoding Technique

- Without Encoding Technique
- Label Encoder (Two Method)
- One-Hot Encoder
- Ordinal Encoder

## Without Encoding Technique

In [20]:
# Replace by assign manually
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'], [1,2,3])  # Repace by definition 1 = Dhaka, 2= Ctg, 3 = Rangpur 
df.Area.head()

0    1
1    2
2    3
3    1
4    3
Name: Area, dtype: int64

In [21]:
df.head() # Check & Verify

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     2  191792.06
2        153441.51       101145.55  407934.54     3  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     3  166187.94

## Label Encoder

In [22]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [23]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

### Method 1 - Label Encoding Manual

In [24]:
df1.Area = le.fit_transform(df1.Area) # Ses the encoding as per alphabatic order
df1.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

### Method 2 - Label Encoding by Using Loop

In [25]:
import numpy as np                  # For checking Number data type
import warnings as war
war.filterwarnings('ignore')

In [26]:
for column in df4.columns:                         # loop will run for all columns in df4
    if df4[column].dtype == np.number:             # no encoding for number, when df4 column contain numbers. it will check dtype whether its number not not,then continue
        continue
    df4[column] = le.fit_transform(df4[column])    # otherwise le to encoding by transform when its not number
      
df4.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

### Method 3 - Label Encoding

In [27]:
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [28]:
from pandas.core.dtypes.common import is_numeric_dtype

In [29]:
for column in df5.columns:
    if is_numeric_dtype(df5[column]):
        continue
    else:                                    # in case of last line, it works without else too
        df5[column] = le.fit_transform(df5[column])
        
df5.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# One Hot Encoding

- Dummy: Additional dummy variable/columns are created for a particular categorical values
- After creating dummy variable, original 'Area' column (df6) need to drop
- After dropping, original df need to contact with the dummies (e.g df6, dummy, axis=1)

In [30]:
df6.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [31]:
dummy = pd.get_dummies(df6['Area'])
dummy.head()

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

In [32]:
# Prefix
dummy = pd.get_dummies(df7['Area'], prefix='encoded')
dummy.head()

   encoded_Ctg  encoded_Dhaka  encoded_Rangpur
0            0              1                0
1            1              0                0
2            0              0                1
3            0              1                0
4            0              0                1

In [33]:
# Dummy Variable Trap (why drop, because 1 can be understand depending value from two)
dummy = pd.get_dummies(df7['Area'], prefix='Area', drop_first=True) # drop_first=True means auto delete of first col, False is default
dummy.head()

   Area_Dhaka  Area_Rangpur
0           1             0
1           0             0
2           0             1
3           1             0
4           0             1

### Drop Column

In [34]:
# df6 = df6.drop(columns=['Area'])
df6 = df6.drop('Area', axis=1)
df6.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

## Concatenation

- df6 is a single df, and dummy is another df, both together will be a complete dataset

In [35]:
new_df6 = pd.concat([df6,dummy], axis=1)  # Now its ready for ML
new_df6.head()

,Marketing Spend,Administration,Transport,Profit,Area_Dhaka,Area_Rangpur
0,114523.61,136897.80,471784.10,192261.83,1,0
1,162597.70,151377.59,443898.53,191792.06,0,0
2,153441.51,101145.55,407934.54,191050.39,0,1
3,144372.41,118671.85,383199.62,182901.99,1,0
4,142107.34,91391.77,366168.42,166187.94,0,1

#### Extract X & Y from the scaled dataset

In [36]:
y = new_df6.Profit                  # Target
x = new_df6.drop('Profit', axis=1)  # Feature

In [37]:
x.head()

   Marketing Spend  Administration  Transport  Area_Dhaka  Area_Rangpur
0        114523.61       136897.80  471784.10           1             0
1        162597.70       151377.59  443898.53           0             0
2        153441.51       101145.55  407934.54           0             1
3        144372.41       118671.85  383199.62           1             0
4        142107.34        91391.77  366168.42           0             1

In [38]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

### One Hot Encoding by for loop (Now do the same by loop)

In [39]:
# Application1

col = ['Area']

for column in col:
    one = pd.get_dummies(df7[column])
    df7 = pd.concat([df7,one],axis=1).drop(column,axis=1)
    
df7.head()

   Marketing Spend  Administration  Transport     Profit  Ctg  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83    0      1        0
1        162597.70       151377.59  443898.53  191792.06    1      0        0
2        153441.51       101145.55  407934.54  191050.39    0      0        1
3        144372.41       118671.85  383199.62  182901.99    0      1        0
4        142107.34        91391.77  366168.42  166187.94    0      0        1

In [40]:
# Application-2

col = ['Area']

for column in col:
    one = pd.get_dummies(df8[column], drop_first=True,prefix='Area')
    df8 = pd.concat([df8,one],axis=1).drop(column,axis=1)
df8.head()

,Marketing Spend,Administration,Transport,Profit,Area_Dhaka,Area_Rangpur
0,114523.61,136897.80,471784.10,192261.83,1,0
1,162597.70,151377.59,443898.53,191792.06,0,0
2,153441.51,101145.55,407934.54,191050.39,0,1
3,144372.41,118671.85,383199.62,182901.99,1,0
4,142107.34,91391.77,366168.42,166187.94,0,1

## Ordinal Encoding

In [44]:
# Import Module & Creating Object

from sklearn.preprocessing import OrdinalEncoder
ordinal = OrdinalEncoder()
ordinal

OrdinalEncoder()

In [41]:
df9.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [43]:
city = ['Dhaka', 'Ctg', 'Rangpur']  # Keep the unique var in a seperate var e.g City

OrdinalEncoder()

In [48]:
ordinal = OrdinalEncoder(categories=[city])  # In ordinal encoder, categories must be defined e.g "city"
ordinal

OrdinalEncoder(categories=[['Dhaka', 'Ctg', 'Rangpur']])

In [51]:
encoded = ordinal.fit_transform(df9[['Area']])   # 2D, as we want to see on row & col
encoded  # a new name can be given for this var, as below code

array([[0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [2.],
       [1.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.],
       [1.],
       [2.],
       [1.],
       [0.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.]])

In [54]:
# Rename Encoded Column
en = pd.DataFrame(encoded, columns=['Area_Renamed'])  
en.head()

   Area_Renamed
0           0.0
1           1.0
2           2.0
3           0.0
4           2.0

In [56]:
cols = ['Area']

for col in cols:
    unique = df10[col].unique()
    df10[col] = OrdinalEncoder(categories=[unique]).fit_transform(df10[[col]])
    
df10.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10   0.0  192261.83
1        162597.70       151377.59  443898.53   1.0  191792.06
2        153441.51       101145.55  407934.54   2.0  191050.39
3        144372.41       118671.85  383199.62   0.0  182901.99
4        142107.34        91391.77  366168.42   2.0  166187.94